/*
*********************************************************************************************************
*
*                                     BOARD SUPPORT PACKAGE (BSP)
*
* Filename      : BSP_UART.h
* Version       : V1.00
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                                 MODULE
*********************************************************************************************************
*/

#ifndef _BSP_UART_H
#define _BSP_UART_H

/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/

#include "sys.h"

/*
*********************************************************************************************************
*                                           	Para DEFINES
*********************************************************************************************************
*/

#define UART8_Rx_Buffer_Num 256
#define UART8_Tx_Buffer_Num 256

//RS485端口定义
#define RS485_Tx_Mode			(HAL_GPIO_WritePin(GPIOE,GPIO_PIN_2,GPIO_PIN_SET))
#define RS485_Rx_Mode			(HAL_GPIO_WritePin(GPIOE,GPIO_PIN_2,GPIO_PIN_RESET))

/*
*********************************************************************************************************
*                                           	Para DEFINES
*********************************************************************************************************
*/

extern uint8_t  DMA_UART8_Rx_Buffer[UART8_Rx_Buffer_Num];  // DMA中UART8接收原始数据缓冲区
extern uint8_t  UART8_Rx_Buffer[UART8_Rx_Buffer_Num];  // UART8接收原始数据缓冲区
extern uint8_t 	UART8_Rx_SIGN;					// UART8接收新数据标志
extern uint8_t 	UART8_Rx_Num;					//	UART8接收数据个数
extern uint8_t  DMA_UART8_Tx_Buffer[UART8_Tx_Buffer_Num];  // DMA中UART8发送原始数据缓冲区
extern uint8_t  UART8_Tx_Buffer[UART8_Tx_Buffer_Num];  // UART8发送原始数据缓冲区
extern uint8_t 	UART8_Tx_SIGN;					// UART8发送新数据标志



/*
*********************************************************************************************************
*                                              SERVICES
*********************************************************************************************************
*/

void UART8_Init(u32 bound);
void UART8_DMA_Sent(u8 * Sendbuff, u16 Bufflens);

#endif
