#ifndef _USART_H
#define _USART_H
#include "sys.h"
#include "stdio.h"	
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK STM32F7开发板
//串口1初始化		   
//正点原子@ALIENTEK
//技术论坛:www.openedv.csom
//修改日期:2015/6/23
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 正点原子 2009-2019
//All rights reserved
//********************************************************************************
//V1.0修改说明 
////////////////////////////////////////////////////////////////////////////////// 	

#define EN_UART5_RX 			1		//使能（1）/禁止（0）串口5接收	
#define EN_UART8_RX 			1		//使能（1）/禁止（0）串口5接收


//如果想串口中断接收，请不要注释以下宏定义
void UART5_Init(u32 bound);
void UART8_Init(u32 bound);
#endif
