/*
*********************************************************************************************************
*
*                                     			参数及功能配置文件
*
* Filename      : Config.h
* Version       : V1.00
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                                 MODULE
*********************************************************************************************************
*/

#ifndef _Config_H_
#define _Config_H_

/*
*********************************************************************************************************
*                                              INCLUDE FILES
*********************************************************************************************************
*/



/*
*********************************************************************************************************
*                                             Para DEFINES
*********************************************************************************************************
*/

////////////////////////////////////////////////////////
//电路板参数设置
////////////////////////////////////////////////////////

#define   BMS_No   1  //1号板

#if (BMS_No == 1)

#define BMS_AVCC_Ref            		(3000)          //MCU ADC采样的模拟电压基准3000mV
#define Filter_Facotr            		(1.9884f)          //R上 9.969  R下 10.086  算系数
#define Pulse_Facotr            		(2.0007f)          //R上 9.971  R下 9.964		算系数
#define Current_REF_V_Filter     		(2176.8f)    			//mV霍尔传感器零点电压
#define Current_REF_V_Pulse     		(2176.6f)    			//mV霍尔传感器零点电压
#define TOTAL_IC (1)     //从板启用IC个数

#elif (BMS_No == 2)

#define BMS_AVCC_Ref            		(3000)          //MCU ADC采样的模拟电压基准3000mV
#define Filter_Facotr            		(2)          //R上 9.976  R下 9.976		算系数
#define Pulse_Facotr            		(2)          //R上 9.980  R下 9.979		算系数
#define Current_REF_V_Filter     		(2175.5f)    			//mV霍尔传感器零点电压
#define Current_REF_V_Pulse     		(2176.6f)    			//mV霍尔传感器零点电压
#define TOTAL_IC (1)     //从板启用IC个数

#else 

#define BMS_AVCC_Ref            		(3000)          //
#define Filter_Facotr            		(2.0f)          //
#define Pulse_Facotr            		(2.0f)          //
#define Current_REF_V_Filter     		(2175)    			//mV霍尔传感器零点电压
#define Current_REF_V_Pulse     		(2175)    			//mV霍尔传感器零点电压
#define TOTAL_IC (1)     //从板启用IC个数

#endif


////////////////////////////////////////////////////////
//电池组参数设置
////////////////////////////////////////////////////////
#define   BATTERY_CAPACITY   (2500)  //电池组容量mah
#define   INIT_CYCL_NUM   (200)   //初始化充放电次数700.0
#define   BATTERY_COUNT    8 //电池节数
#define   TEMP_NUM         3   //温度点数

#define CHARG_REON_CELL_VOLTAGE      (3500)   //单体电池重新启动充电电压
#define CHARG_FULL_CELL_VOLTAGE     (3550)   //认为充满电压


#define MAX_BATTERY_DAYS            (1095)          //电池组最大日历寿命
#define Hours_Split            			(3600000)       //计算SOC初始容量的时间基准ms

/*
*********************************************************************************************************
*                                              SERVICES
*********************************************************************************************************
*/
#define max(a, b)           (a>b? a:b)  
#define min(a, b)           (a<b? a:b)  
#define range(x, a, b)      (min(max(x, a), b)) 

#endif



